Revit 2024 API
FailureMessage.SetAdditionalElements Method
 Sets the additional reference elements for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureMessage SetAdditionalElements(
	ICollection<ElementId> additionalElements
)
Visual Basic
Public Function SetAdditionalElements ( _
	additionalElements As ICollection(Of ElementId) _
) As FailureMessage
Visual C++
public:
FailureMessage^ SetAdditionalElements(
	ICollection<ElementId^>^ additionalElements
)
Parameters
additionalElements
Type: System.Collections.Generic.ICollection<ElementId>
 The additional elements.
Return Value
 The FailureMessage.
Remarks
 Additional elements are used to highlight additional information to the user. They are not considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailureMessage is already posted to a document
See Also
FailureMessage Class
Autodesk.Revit.DB Namespace